notes/20241112-python-setup.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using Python in Emacs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/org-base.css"/>
<link rel="stylesheet" type="text/css" href="/orgstyle.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=IBM+Plex+Sans:wght@400;500;600;700&display=swap" rel="stylesheet">
<link rel="icon" href="/favicon.ico" type="image/x-icon">
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon">
<link rel="me" href="https://emacs.ch/@dliden">
<link rel="alternate" type="application/rss+xml" title="Daniel Liden's Blog" href="/rss.xml">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="canonical" href="https://danliden.com/notes/20241112-python-setup.html">
<meta name="author" content="Daniel Liden">
<meta property="og:url" content="https://danliden.com/notes/20241112-python-setup.html">
<meta property="og:title" content="Using Python in Emacs">
<meta property="og:description" content="I will keep this note up to date with details on how I use emacs for Python development.">
<meta property="og:site_name" content="Daniel Liden">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2024-11-12T00:00:00Z">
<meta property="article:modified_time" content="2025-10-02T15:00:34Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Using Python in Emacs">
<meta name="twitter:description" content="I will keep this note up to date with details on how I use emacs for Python development.">
</head>
<body>
<div id="preamble" class="status">
<hr class="topnav-rule">
<header class="site-header">
  <a href="/index.html" class="site-header__brand">
    <h2>Daniel Liden</h2>
  </a>
  <nav class="topnav-links" aria-label="Primary">
    <a href="/archive.html">Blog</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/about.html">About Me</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/photos.html">Photos</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notebooks/">Notebooks</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notes.html">Notes</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a class="topnav-icon" href="/rss.xml" aria-label="RSS feed">
      <svg class="rss-icon" viewBox="0 0 24 24" aria-hidden="true" fill="none" stroke="currentColor" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round">
        <path d="M5 4h1a14 14 0 0 1 14 14v1"/>
        <path d="M5 11h1a7 7 0 0 1 7 7v1"/>
        <circle cx="6" cy="18" r="2"/>
      </svg>
    </a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <button id="theme-toggle" class="nav-theme-toggle topnav-icon" type="button" aria-label="Switch to dark mode" aria-pressed="false">
      <svg class="theme-icon" viewBox="0 0 24 24" aria-hidden="true" fill="currentColor">
        <path d="M21 12.79A9 9 0 1 1 11.21 3 7 7 0 0 0 21 12.79Z"/>
      </svg>
    </button>
  </nav>
</header>
<hr class="topnav-rule">
</div>
<div id="content" class="content">
<header>
<h1 class="title">Using Python in Emacs</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga36d171">Introduction</a></li>
<li><a href="#org1444eed">Setting up a Python project</a>
<ul>
<li><a href="#orgb4182ca">Using multiple language servers with eglot</a></li>
</ul>
</li>
<li><a href="#org0763518">IN PROGRESS Writing and Executing Python Code</a>
<ul>
<li><a href="#org08be79a">Writing + Code with Org Babel</a></li>
<li><a href="#org4d47f50">IN PROGRESS Source files + REPL approach</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-orga36d171" class="outline-2">
<h2 id="orga36d171">Introduction</h2>
<div class="outline-text-2" id="text-orga36d171">
<div class="preview" id="org8273425">
<p>
I will keep this note up to date with details on how I use emacs for Python development.
</p>

</div>
</div>
</div>
<div id="outline-container-org1444eed" class="outline-2">
<h2 id="org1444eed">Setting up a Python project</h2>
<div class="outline-text-2" id="text-org1444eed">
<p>
There are a few things I want when setting up a Python project:
</p>
<ul class="org-ul">
<li>a virtual environment</li>
<li>a language server (for use via eglot)</li>
<li>an interpreter that works well with emacs</li>
</ul>

<p>
To that end, when setting up a project, I follow these steps:
</p>
<ol class="org-ol">
<li>Create a new directory for my project, or navigate to an existing project directory.</li>
<li>Create a new virtual environment in that directory, with e.g. <code>uv venv -p 3.13 myenv</code> (I <a href="https://www.danliden.com/notes/20240821-uv.html">tend to use</a> uv for python package/environment management these days).</li>
<li>Activate the virtual environment. I use <a href="https://github.com/jorgenschaefer/pyvenv">pyvenv</a> and activate environments via <code>pyvenv-activate</code>. Sometimes, I still need to explicitly call <code>source ./myenv/bin/activate</code> in e.g. an open vterm buffer. In general, it's a good idea to make sure the environment is active and running as expected before doing anything.</li>
<li>Set up eglot—in your virtual environment, install <code>python-lsp-ruff</code> or <code>ruff-lsp</code> or whatever Python language server provides the functionality you want. It's also worth installing <code>isort</code> if you want to sort your imports with e.g. <code>python-sort-imports</code>.</li>
<li>Install and configure <code>gnureadline</code> for native completions (if you get the <code>Warning (python): Your ‘python-shell-interpreter’ doesn’t seem to support readline, yet ‘python-shell-completion-native’ was t and "python3" is not part of the ‘python-shell-completion-native-disabled-interpreters’ list. Native completions have been disabled locally.</code> warning). See <a href="https://www.danliden.com/notes/20240709-python-readline.html">here</a> for instructions.</li>
<li>Create/open a python buffer and start eglot with <code>M-x eglot</code>.</li>
</ol>
</div>
<div id="outline-container-orgb4182ca" class="outline-3">
<h3 id="orgb4182ca">Using multiple language servers with eglot</h3>
<div class="outline-text-3" id="text-orgb4182ca">
<p>
For some reason, I recall this working without additional configuration before. But it's now, so I might as well document how to get it working. My best guess is that I overrode the defaults as the eglot docs note that "Eglot comes with a fairly complete set of associations of major-modes to popular language servers predefined." 
</p>

<p>
Suppose you have installed two different options for a Python LSP. Follow the instructions <a href="https://www.gnu.org/software/emacs/manual/html_node/eglot/Setting-Up-LSP-Servers.html">here</a>.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">with-eval-after-load</span> 'eglot
  (add-to-list
   'eglot-server-programs
   `(python-mode
     .
     ,(eglot-alternatives
       '((<span class="org-string">"ruff"</span> <span class="org-string">"server"</span>) (<span class="org-string">"basedpyright-langserver"</span> <span class="org-string">"--stdio"</span>))))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0763518" class="outline-2">
<h2 id="org0763518">IN PROGRESS Writing and Executing Python Code</h2>
<div class="outline-text-2" id="text-org0763518">
<p>
After setting up the Python project as described above, I tend to follow one of two approaches:
</p>
</div>
<div id="outline-container-org08be79a" class="outline-3">
<h3 id="org08be79a">Writing + Code with Org Babel</h3>
<div class="outline-text-3" id="text-org08be79a">
<p>
I often write and execute code blocks in org mode using <a href="https://orgmode.org/worg/org-contrib/babel/intro.html">babel</a>. A lot of my coding work occurs in the context of writing examples and demos (I am a developer advocate) so demonstrating and writing about code segments is often more important to me than working on projects/source files.
</p>

<p>
This isn't a guide to using org babel, so please consult the docs if you are unfamiliar with it. You can find this inside emacs! Use <code>C-h R (info-display-manual)</code> and search for <code>org</code> to find the org mode manual, then navigate to the "Working with Source Code" section.
</p>

<p>
When working with org babel, I tend to do the following for convenience:
</p>
<ul class="org-ul">
<li><p>
<b>Set header args in properties</b>: I will usually set at least a <i>session</i> via properties on the parent org mode header. Multiple babel blocks with the same session share an execution context, much like multiple code blocks in a Jupyter notebook. So variables defined in one block will persist to the next block that has the same session name.
</p>

<p>
Here's what that looks like:
</p>

<div class="org-src-container">
<pre class="src src-org">*Headline 1
<span class="org-org-drawer">:PROPERTIES:</span>
<span class="org-org-special-keyword">:header-args:python:</span> <span class="org-org-property-value">:session session_name</span>
<span class="org-org-drawer">:END:</span>

<span class="org-org-block-begin-line">#+begin_src python
</span><span class="org-org-block"><span class="org-variable-name">x</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-operator">=</span></span><span class="org-org-block"> 42
</span><span class="org-org-block-end-line">#+end_src
</span>
<span class="org-org-meta-line">#+RESULTS:</span>
<span class="org-org-code">: None
</span>

<span class="org-org-block-begin-line">#+begin_src python
</span><span class="org-org-block">x
</span><span class="org-org-block-end-line">#+end_src
</span>
<span class="org-org-meta-line">#+RESULTS:</span>
<span class="org-org-code">: 42</span>
</pre>
</div>

<p>
Now, as you can see, all newly-created Python source blocks under <code>Headline 1</code> will automatically be associated with the session <code>session_name</code> and you won't need to manually specify the session in each block.
</p></li>
<li><p>
<b>Define snippets to quickly create source blocks</b>: I use <a href="https://joaotavora.github.io/yasnippet/">YASnippet</a> to make it quicker and easier to define new source blocks in my chosen language, without needing to type out <code>C-c , s python</code> each time I need a new source block.
</p>

<p>
Here is an example snippet:
</p></li>
</ul>

<div class="org-src-container">
<pre class="src src-org"><span class="org-comment"># -*- mode: snippet -*-</span>
<span class="org-comment"># name: python babel source block</span>
<span class="org-comment"># key: p</span>
<span class="org-comment"># contributor: Daniel Liden</span>
<span class="org-comment"># --</span>

<span class="org-org-block-begin-line">#+begin_src python :results ${1:verbatim}
</span><span class="org-org-block">$0
</span><span class="org-org-block-end-line">#+end_src</span>
</pre>
</div>

<p>
With this snippet, you can simply type <code>p</code> and then <code>yas-expand</code> (I have this set to <code>TAB</code>). It will create the source block with your cursor set to the results type, which will default to <code>verbatim</code>. Hitting tab again will bring you to the body of the source block (where <code>$0</code> is), and you can start writing your code. This saves a few keystrokes.
</p>
<ul class="org-ul">
<li><b>Displaying graphics/tables/plots</b>: I have never found this straightforward and usually need to do some troubleshooting whenever I try it. In general, I find it easier to write the graphic to a file and then, separately, display the file in org mode rather than trying to get the source block to yield and display the file directly. That said, <a href="https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html#org8875314">this</a> is a good resource to consult for the various options for displaying graphics.</li>
</ul>
</div>
</div>
<div id="outline-container-org4d47f50" class="outline-3">
<h3 id="org4d47f50">IN PROGRESS Source files + REPL approach</h3>
<div class="outline-text-3" id="text-org4d47f50">
<p>
When working on a Python project, I use a source file + REPL approach. Setting this up in a basic way is simple. First, make sure you have the appropriate Python virtual environment set up (with e.g. <code>pyvenv-activate</code>). Then, with a <code>.py</code> file open, call <code>M-x run-python</code> to start a Python REPL. When you want to run a code snippet, or all the code in a given file, you can use one of the various <code>python-shell-send-*</code> commands to run the code from your source file in the REPL. Some of my most used ones are:
</p>
<ul class="org-ul">
<li><code>python-shell-send-buffer (C-c C-c)</code>: evaluate the whole buffer</li>
<li><code>python-shell-send-region (C-c C-r)</code>: evaluate a region (highlighted/selected section of code)</li>
<li><code>python-shell-send-statement (C-c C-e)</code>: evaluate the statement at the current point. If you have a marked region, this will act the same as <code>python-shell-send-region</code>. Otherwise, this essentially just sends the current line, which is often what I want.</li>
</ul>

<p>
I will say that the various send commands did not behave exactly the way I expected them to, so it is worthwhile to experiment. Make a python file with some classes, functions, and unencapsulated code snippets and see how these commands behave. Marking and then sending a region is the most reliable and precise approach.
</p>

<p>
Here are some additional tips for using this workflow (<i>will fill these out in the future</i>):
</p>
<ul class="org-ul">
<li><b>Use a Language Server</b>: I use the <a href="https://joaotavora.github.io/eglot/">eglot</a> language server protocol (LSP) client for emacs, with the <a href="https://docs.basedpyright.com/latest/">basedpyright</a> and/or <a href="https://docs.astral.sh/ruff/editors/setup/#emacs">ruff server</a> language server(s).</li>
<li><b>Use <a href="https://magit.vc/">magit</a> for git workflows:</b> Magit is an <i>excellent</i> TUI for git that provides a quick and intuitive way to handle all of your version control tasks.</li>
<li><b>Use <a href="https://docs.projectile.mx/projectile/index.html">projectile</a> for navigating within a project:</b> Projectile has a variety of tools for navigating your project structure, searching and browsing project files, etc.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-11-12 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
